[{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*6UEJMr29aT5xWruC.jpeg","title":"Popular Hits of the Showa Era, Ryu Murakami","url":"https:\/\/medium.com\/editors-picks\/c97a08e3d666","author":"Pushkin Press","excerpt":"Our third Ryu Murakami extract this week, from Popular Hits of the Showa Era, an unforgettably savage tale of karaoke-inspired carnage, published by Pushkin Press in May.\n\n \n\n1\n\n Season of Love\n\nI\n\n Ishihara had had a feeling, ever since the party the night before, that something…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*mck--jCml8PL94oB.jpeg","title":"Why I’m glad good characters died in “Game of Thrones”","url":"https:\/\/medium.com\/editors-picks\/98f15bdd3ddd","author":"Tauriq Moosa","excerpt":"No doubt you’re reading this after cupping a hand to your mouth, shaking your head, crying out loud, or something equally reactive. The infamous “Red Wedding” scene in Game of Thrones has ripped the hearts out of many a bewildered TV watcher — despite constant warnings from the w…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*oLQlopG3_5Wzvj7x.jpeg","title":"How to Address the President of Rwanda","url":"https:\/\/medium.com\/editors-picks\/15fbc3f28d","author":"Brian Orme","excerpt":"“Good morning, Muzungoo!” the children shouted as they waved to us from the street. It was 6 p.m. in Rwanda. I was traveling as a journalist with World Vision, a humanitarian organization that fights the causes of extreme poverty and helps children and families through child spon…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*3OoY6i2jqN9IdFgw.jpg","title":"How to Lose the Game of Thrones","url":"https:\/\/medium.com\/editors-picks\/56f3cb13fae4","author":"Kelsey D Atherton","excerpt":"Spoiler warning: Central to this post are events in Season 3, Episode 9 of Game of Thrones.\n\nThe essence of war is the political. Misunderstand that, and no amount of force can achieve victory. Master it, and force might not be needed at all. This is as true on earth as it is in …"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*LMxpBpjHBNWKmgBw.jpg","title":"The spectacular serendipity of being a science writer ","url":"https:\/\/medium.com\/editors-picks\/7ad4f6a8628","author":"Bobbie Johnson","excerpt":"Was there a specific moment that made you follow the path you’re on? An inspiration? A revelation?\n\nIt was serendipity. I joined The Times as a graduate trainee, moved onto the staff, and was working as a junior leader writer, when I was asked \/ told by the then editor to take on…"}]