[{"url":"http:\/\/liisten.com\/pintrest-meets-the-business-world-with-fusingscom\/","title":"Pintrest Meets The Business World With Fusings.com","author":"Tyler Hayes","excerpt":"There are social networks and then there are social networks aimed at the business sector looking to brand and enterprise anything they touch. Fusings may not be completely corporate in its feel, adapting the Pintrest look to â\u0080\u009cBuilding a better professional brand,“ but it’s close.\n\nVis..."},{"url":"http:\/\/kirill.io\/starting-a-company-is-not-the-same-as-running-one\/","title":"Starting a company is not the same as running one. Remember that.","author":"Kirill Zubovsky","excerpt":"A few years ago I was just a kid who moved to Seattle because the weather was good and the rent was cheap. I had a dream to start a company and nothing else mattered. I loved it then as much as I love it now, and having had a number of young people approach me lately, asking about my experience an..."},{"url":"http:\/\/blog.capwatkins.com\/tie-your-ego-to-the-product-not-the-process\/","title":"Tie Your Ego to the Product, Not the Process","author":"Cap Watkins","excerpt":"I was beginning to design my first big feature at Etsy a few months ago and had a kick-off meeting with Andrew, the engineer who would be building it out with me. We talked about design goals, problems to be solved, etc. and everything was feeling pretty good. As we were walking out of the meeting..."},{"url":"http:\/\/tomtunguz.com\/the-dawn-of-the-voicetotext-era\/","title":"The Dawn of the Voice-to-Text Era","author":"Tomasz Tunguz","excerpt":"\n\nWe all type quite a bit. I’ve never measured how many words each day I type but I imagine it’s probably a few thousand each week between my laptop and my mobile phone and across emails and blog posts. And no one can deny the toll this takes on our wrists.  \n\nIn the past week, I&rsquo..."},{"url":"http:\/\/wayoftheduck.com\/subjectivity\/","title":"Experimenting with subjectivity","author":"Buster Benson","excerpt":"After going to the Quantified Self conference last month and thinking about it for a few weeks, I’ve decided to start a new self-tracking experiment… or rather to adapt my existing one to new thoughts on what’s worth tracking.\n\nSo, tonight I made a list of my four top interests,..."}]