[{"url":"http:\/\/tomtunguz.com\/the-most-underrated-startup-member\/","title":"The Most Under-Appreciated Startup Team Member","author":"Tomasz Tunguz","excerpt":"\n\nThe reason most startups go out of business is they run out of money. The CEO bears the responsibility for raising money, managing those assets and growing the business into profitability and ultimate sustainability.\n\nBut the CEO shouldn’t bear this load alone. To help defray that critical..."},{"url":"http:\/\/liisten.com\/the-absolute-best-canopy-climbers\/","title":"The Absolute Best New Music: Canopy Climbers - ‘Miles’","author":"Tyler Hayes","excerpt":"\n\nCanopy Climbers aren’t a well known band. Their previous album ‘Distances’ wasn’t talked about on many blogs and though breathtaking, didn’t win any awards. This band, however, is the reason I continue to search for new music from those currently unknown. It’s..."},{"url":"http:\/\/adii.me\/bad-loser\/","title":"Being A Bad Loser","author":"Adii Pienaar","excerpt":"I’m ultra-competitive and I absolutely despise losing. At anything. It doesn’t mind whether I’m working on my business or playing a game of Scrabble. I always play to win.\n\nAnd that’s a good thing.\n\nIn Grade 6 & 7 I had a teacher that always told us: “Show me a go..."},{"url":"http:\/\/liisten.com\/pintrest-meets-the-business-world-with-fusingscom\/","title":"Pinterest Meets The Business World With Fusings.com","author":"Tyler Hayes","excerpt":"There are social networks and then there are social networks aimed at the business sector looking to brand and enterprise anything they touch. Fusings may not be completely corporate in its feel, adapting the Pinterest look to â\u0080\u009cBuilding a better professional brand,“ but it’s close.\n\nVi..."},{"url":"http:\/\/kirill.io\/starting-a-company-is-not-the-same-as-running-one\/","title":"Starting a company is not the same as running one. Remember that.","author":"Kirill Zubovsky","excerpt":"A few years ago I was just a kid who moved to Seattle because the weather was good and the rent was cheap. I had a dream to start a company and nothing else mattered. I loved it then as much as I love it now, and having had a number of young people approach me lately, asking about my experience an..."}]