[{"url":"http:\/\/articles.morganallanknutson.com\/its-a-matter-of-taste\/","title":"It’s a matter of taste","author":"Morgan Knutson","excerpt":"This is a quick note on the flat v. depth debate and I can already hear you thinking, “Whatever, brah.”  I'll be quick as I'm not trying grind this horse into a fine paste let alone kick it another time. \n\n\n\nI don't believe that either “style” or “philosop..."},{"url":"http:\/\/daslee.me\/monthly-growth-and-the-rule-of-72\/","title":"Startups, Growth and the Rule of 72","author":"David Lee","excerpt":"This essay by Paul Graham is one of the best on startups. In short, he makes the point that startups (and investors) covet growth. Without it, nothing else really matters.\n\nI'm not the only one who thinks this was essential reading. With that in mind, more and more startups include their growt..."},{"url":"http:\/\/benyu.org\/desperation\/","title":"Desperation","author":"Ben Yu","excerpt":"There's this interesting notion that desperation is the best thing that can happen to us. I just watched two movies for Mother's Day with my mom - The Great Gatsby, and Iron Man 3. In a way, both were about desperation, but the last one explicitly, so I'll start there.\n\nAldrich Killian..."},{"url":"http:\/\/sefsar.com\/the-memeification-of-cancer\/","title":"The Memeification of Cancer","author":"Youssef Sarhan","excerpt":"Today, while enjoying one of Ireland's few sunny days, I couldn't help but notice a large advertisement on the back of a bus. It was by the Irish Cancer Society, and presumably designed to inform people about the risks of skin cancer. Yet, I couldn't help but feel offended.\n\n\n\nThe adve..."},{"url":"http:\/\/sefsar.com\/knowledge-exchange\/","title":"Knowledge Exchange","author":"Youssef Sarhan","excerpt":"Kyle MacDonald is a Canadian blogger who over the course of a year bartered his way from a single red paperclip to a house. As one would assume, he did so by incrementally increasing the value of each transaction in his favor.\n\nThe story began on 14 July 2005, when MacDonald travelled to Vancouver..."}]