[{"url":"http:\/\/theratchet.ca\/future-humans\/","title":"Future Humans","author":"Cadell Last","excerpt":"\n\nHumans evolved.  We have been aware of this reality for 150 years, yet the implications are not apparent to most.  What we have discovered about evolution is that it is A) not goal oriented and B) not hierarchical (i.e., there is no end state).  This means that humans, as we currently exist, wil..."},{"url":"http:\/\/leemart.in\/damage\/","title":"100% Chance of Social","author":"Lee Martin","excerpt":"\n\nI’ve always been fascinated by weather, and one million websites ago I thought about becoming a meteorologist. That’s probably because I grew up in south Louisiana where we have a “season” for destructive storms. I remember riding out Hurricane Andrew on a house boat with..."},{"url":"http:\/\/tomtunguz.com\/clouds-and-prism\/","title":"Why PRISM May Herald a New Golden Age for P2P","author":"Tomasz Tunguz","excerpt":"\n\nOver the past 15 years, we’ve seen a wholesale migration of software development on the web towards cloud away from client\/server models.  The  cloud offers many benefits: seamless upgrades, synchronization of data across different devices and lesser hardware requirements.\n\nBut the cloud c..."},{"url":"http:\/\/travisherrick.com\/getting-swoll\/","title":"Getting Swoll","author":"Travis Herrick","excerpt":"I work out.\n\nA few weeks ago, I did not work out.  At various other times in my life, I also did not work out, or I did work out, or I worked out the very minimum such that I could say I work out without feeling like a liar.  What triggered this last bout was a friend of mine who works out every d..."},{"url":"http:\/\/aaronisthinking.com\/welcome-to-wwdc-2013\/","title":"Welcome to the WWDC 2013 Keynote ","author":"Aaron Souppouris","excerpt":"A work of probably-non-prophetic fiction.\n\n“Hi guys, I’m so pleased to have you here. We’ve sold so many iPhones, so many iPads, and so many Macs. Isn’t that fantastic? We’re pretty happy about that. Just a few weeks ago, we announced that we’ve sold loads of ap..."}]