[{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*_Ab7GhrleZjcn3dE.jpeg","title":"Medium’s Weekend Reads","url":"https:\/\/medium.com\/editors-picks\/a99626107c72","author":"Nick Fisher","excerpt":"THIS WEEK’S TOP POSTS\n\nRemembering Futurism\nby @grantdraws\n“We want no part of it, the past,” Filippo Tommaso Marinetti wrote in his “Futurist Manifesto” of 1909, which was meant to change art forever. Grant Snider, a New York Times illustrator, puts his own pen to paper, and ask…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*aiaqdXEMPQubcy8Q.jpeg","title":"I’ll Take Manhattan","url":"https:\/\/medium.com\/editors-picks\/cd19c630f090","author":"Lindseymgreen","excerpt":"In 1898, what are now the five boroughs of the city of New York were united for the first time, adding a million residents to what was already the largest metropolis in America. One borough-to-be in particular was a holdout, eventually joining but reluctant to do so. That was Bro…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*114BAEd5p5BtGHwd.jpeg","title":"To the Dauntless Lensmen","url":"https:\/\/medium.com\/editors-picks\/ceed8a42f354","author":"Jeff Jarvis","excerpt":"The Sun-Times was wrong and right when it fired its entire photo department. \n\nWrong: Images are more important than ever. Look at this page: Medium practically forces us to include a photo with every post. On Google+ posts sans images get little love. This week at my J-school, a…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*aOhUeUneAB1jdXEc.jpeg","title":"Becoming the Mentor I Want to Be vs. the Mentor I Need to Be","url":"https:\/\/medium.com\/editors-picks\/c4bfa75746bb","author":"Dr. Isis","excerpt":"Last week I attended a memorial for a physician and scientist in my field. This man had died far too young, but despite his short life, had made some incredible contributions to our discipline. The main purpose of this ceremony was that, in honor of his work and achievements, our…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*6DYALKPQP7z5-MMv.jpeg","title":"How to Get the Most Out of Hacker School","url":"https:\/\/medium.com\/editors-picks\/ab08782397f8","author":"Sasha Laundy","excerpt":"Monday is the first day of the summer batch of Hacker School. You and about 70 other bright-eyed and bushy-tailed programmers will be starting twelve amazing weeks together. \n\nIn addition to the excellent advice that Dave and Nick will give you on day one, here are some ideas to …"}]