[{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*h_NYk9lDyNVs600N.jpeg","title":"The Worst Company I Ever Worked For","url":"\/editors-picks\/a866dd726c81","author":"Emma Siemasko","excerpt":"I’m a writer. My first job out of college was teaching English in South Korea. That was a difficult job, and most nights I cried myself to sleep out of homesickness and cultural confusion. My next job was much worse. I came back to the U.S. and began work at a content farm. We wr…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*uQzTX2OJNhreOEfd.jpg","title":"Macaroons made easy","url":"\/editors-picks\/2f9b721b6404","author":"Ida-Lise Dirks ","excerpt":"After trying numerous recipes, I have found that Lorraine Pascale´s recipe gives the closest result to a professional macaroon. Check out the episode on Lorraine Pascale’s Macaroons. Through experimentation I have changed the recipe slightly.\n\n123g Icing sugar\n\n125g Ground almond…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*EM3wPW2GCQIYVO37.png","title":"On Playing With Others","url":"\/editors-picks\/25b4a268d54b","author":"Maile Meloy","excerpt":"The great thing about writing fiction is that whatever you\nsay—with enough authority—becomes true. \nThere are no requirements about how many characters you need, or what\nkind. It won’t be more\naesthetically pleasing if you have four people talking during the course of a\nstory, in…"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*PTRd2i-sjnvFiPjD.jpeg","title":"Where will all the traffic go?","url":"\/editors-picks\/68648bc111ae","author":"Chris Jagers","excerpt":"Interstate highways running through dense city centers strangle the potential for those cities to flourish. The highways are falling apart anyway; let’s tear them down. The timing is perfect.\n\nThe most loved cities in the world — like Paris, London, New York, San Francisco — are …"},{"avatar":"https:\/\/d233eq3e3p3cv0.cloudfront.net\/fit\/c\/100\/100\/0*eewqI3Ir9PAdU8FC.jpg","title":"On Not Seeing Stars","url":"\/editors-picks\/fc3f610aaced","author":"Alissa Walker","excerpt":"After ten years in L.A. you might say that I have learned to be a good Angeleno. I say “freeway” now instead of my Midwestern “highway.” I try to be blasé about the weather. I hardly ever wear pants. But the truth is, I do not, in fact, deserve to live in Los Angeles. The reason …"}]